In [17]:
## students records

In [1]:
names_list = ['Kunal', 'Siddharth', 'Sumit', 'Anuj', 'Abhishek']
age_list = [34, 21, 40, 37, 20]
college_list = ['BFIT', 'DIT', 'DIT', 'IMS', 'BFIT']
location_list = ['Dehradun', 'Dehradun', 'Delhi', 'Mumbai', 'Lucknow']

In [2]:
students_dict = {
    'Name': names_list,
    'Age': age_list,
    'College': college_list,
    'Location': location_list
}

In [3]:
print(students_dict)

{'Name': ['Kunal', 'Siddharth', 'Sumit', 'Anuj', 'Abhishek'], 'Age': [34, 21, 40, 37, 20], 'College': ['BFIT', 'DIT', 'DIT', 'IMS', 'BFIT'], 'Location': ['Dehradun', 'Dehradun', 'Delhi', 'Mumbai', 'Lucknow']}

In [4]:
import pandas as pd

In [5]:
students_df = pd.DataFrame(data=students_dict)
students_df

        Name  Age College  Location
0      Kunal   34    BFIT  Dehradun
1  Siddharth   21     DIT  Dehradun
2      Sumit   40     DIT     Delhi
3       Anuj   37     IMS    Mumbai
4   Abhishek   20    BFIT   Lucknow

In [6]:
students_df['Name']

0        Kunal
1    Siddharth
2        Sumit
3         Anuj
4     Abhishek
Name: Name, dtype: object

In [7]:
students_df[students_df['Age']>30]

    Name  Age College  Location
0  Kunal   34    BFIT  Dehradun
2  Sumit   40     DIT     Delhi
3   Anuj   37     IMS    Mumbai

In [8]:
students_df[['Name', 'Age']][students_df['Age']>30]

    Name  Age
0  Kunal   34
2  Sumit   40
3   Anuj   37

In [9]:
students_df.shape

(5, 4)

In [10]:
students_df.shape[0]

5

In [11]:
students_df.shape[1]

4

In [12]:
students_df.columns

Index(['Name', 'Age', 'College', 'Location'], dtype='object')

In [13]:
students_df.Name.unique()

array(['Kunal', 'Siddharth', 'Sumit', 'Anuj', 'Abhishek'], dtype=object)

In [14]:
students_df.groupby(['College'])['Age'].mean()

College
BFIT    27.0
DIT     30.5
IMS     37.0
Name: Age, dtype: float64

In [15]:
students_df.dtypes

Name        object
Age          int64
College     object
Location    object
dtype: object